#!/bin/bash
#badname.sh

#如何匹配包含空格的字符串： 	* * (星号空格星号)
#如何忽略一个命令的报错输出：  	2>/dev/null

for filename in *
do
badname=`echo "$filename" | sed -n /[\+\{\;\"\\\=\?~\(\)\<\>\&\*\|\$]/p`
# badname=`echo "$filename" | sed -n '/[+{;"\=?~()<>&*|$]/p'` 这句也行.
# 删除文件名包含这些字符的文件: +{;"\=?~()<>&*|$
rm $badname 2>/dev/null
# ^^^^^^^^^^^ 错误消息将被抛弃.
done

# 现在, 处理文件名中以任何方式包含空白的文件.
find . -name "* *" -exec rm -f {} \;
# "find"命令匹配到的目录名将替换到"{}"的位置.
# '\'是为了保证';'被正确的转义, 并且放到命令的结尾.

exit 0

#-------------------------------------------------------------------- 

# 这行下边的命令将不会运行, 因为有 "exit" 命令. 

# 下边这句可以用来替换上边的脚本:
find . -name '*[+{;"\\=?~()<>&*|$ ]*' -exec rm -f '{}' \; 27